mizalop/cafe_refactor_orhi/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTE10 (number 4), GRINDER
  @{ */

/* Symbols to be used with GPIO driver */
#define GRINDER_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define GRINDER_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define GRINDER_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GRINDER_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define GRINDER_PIN 10U                   /*!<@brief PORT pin number */
#define GRINDER_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTE4 (number 6), PORTA1
  @{ */

/* Symbols to be used with GPIO driver */
#define PORTA1_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define PORTA1_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define PORTA1_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PORTA1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define PORTA1_PIN 4U                   /*!<@brief PORT pin number */
#define PORTA1_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTE5 (number 5), PORTA2
  @{ */

/* Symbols to be used with GPIO driver */
#define PORTA2_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define PORTA2_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define PORTA2_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PORTA2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define PORTA2_PIN 5U                   /*!<@brief PORT pin number */
#define PORTA2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD1 (number 1), MAG_IN1
  @{ */

/* Symbols to be used with GPIO driver */
#define MAG_IN1_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define MAG_IN1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define MAG_IN1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MAG_IN1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define MAG_IN1_PIN 1U                   /*!<@brief PORT pin number */
#define MAG_IN1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD0 (number 2), MAG_IN2
  @{ */

/* Symbols to be used with GPIO driver */
#define MAG_IN2_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define MAG_IN2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define MAG_IN2_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MAG_IN2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define MAG_IN2_PIN 0U                   /*!<@brief PORT pin number */
#define MAG_IN2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTE11 (number 3), MAG_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define MAG_CTRL_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define MAG_CTRL_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define MAG_CTRL_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MAG_CTRL_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define MAG_CTRL_PIN 11U                   /*!<@brief PORT pin number */
#define MAG_CTRL_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTE8 (number 17), M1_OP
  @{ */

/* Symbols to be used with PORT driver */
#define M1_OP_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define M1_OP_PIN 8U                   /*!<@brief PORT pin number */
#define M1_OP_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTE9 (number 16), M1_CL
  @{ */

/* Symbols to be used with GPIO driver */
#define M1_CL_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define M1_CL_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define M1_CL_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define M1_CL_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define M1_CL_PIN 9U                   /*!<@brief PORT pin number */
#define M1_CL_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTC2 (number 21), M2_OP
  @{ */

/* Symbols to be used with PORT driver */
#define M2_OP_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define M2_OP_PIN 2U                   /*!<@brief PORT pin number */
#define M2_OP_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTD5 (number 24), M2_CL
  @{ */

