mizalop/cafe_refactor_orhi/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define M2_CL_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define M2_CL_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define M2_CL_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define M2_CL_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define M2_CL_PIN 5U                   /*!<@brief PORT pin number */
#define M2_CL_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTB5 (number 18), COM_OP
  @{ */

/* Symbols to be used with GPIO driver */
#define COM_OP_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define COM_OP_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define COM_OP_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define COM_OP_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define COM_OP_PIN 5U                   /*!<@brief PORT pin number */
#define COM_OP_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTB4 (number 19), COM_CL
  @{ */

/* Symbols to be used with PORT driver */
#define COM_CL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define COM_CL_PIN 4U                   /*!<@brief PORT pin number */
#define COM_CL_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTC5 (number 61), TEC1
  @{ */

/* Symbols to be used with GPIO driver */
#define TEC1_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define TEC1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define TEC1_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define TEC1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define TEC1_PIN 5U                   /*!<@brief PORT pin number */
#define TEC1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                      /* @} */

/*! @name PORTA10 (number 58), TEC2
  @{ */

/* Symbols to be used with GPIO driver */
#define TEC2_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define TEC2_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define TEC2_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define TEC2_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define TEC2_PIN 10U                   /*!<@brief PORT pin number */
#define TEC2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTA11 (number 57), TEC3
  @{ */

/* Symbols to be used with GPIO driver */
#define TEC3_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define TEC3_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define TEC3_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define TEC3_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define TEC3_PIN 11U                   /*!<@brief PORT pin number */
#define TEC3_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTA12 (number 56), TEC4
  @{ */

/* Symbols to be used with GPIO driver */
#define TEC4_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define TEC4_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define TEC4_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define TEC4_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define TEC4_PIN 12U                   /*!<@brief PORT pin number */
#define TEC4_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTA13 (number 55), TEC5
  @{ */

/* Symbols to be used with GPIO driver */
#define TEC5_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define TEC5_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define TEC5_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define TEC5_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define TEC5_PIN 13U                   /*!<@brief PORT pin number */
#define TEC5_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTC15 (number 29), LCD_DB0
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB0_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define LCD_DB0_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define LCD_DB0_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB0_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define LCD_DB0_PIN 15U                   /*!<@brief PORT pin number */
#define LCD_DB0_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC16 (number 28), LCD_DB1
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB1_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define LCD_DB1_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define LCD_DB1_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB1_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define LCD_DB1_PIN 16U                   /*!<@brief PORT pin number */
#define LCD_DB1_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC14 (number 30), LCD_DB2
  @{ */

