mizalop/cafe_refactor_orhi/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define LCD_DB2_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define LCD_DB2_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define LCD_DB2_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB2_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define LCD_DB2_PIN 14U                   /*!<@brief PORT pin number */
#define LCD_DB2_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC17 (number 27), LCD_DB3
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB3_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define LCD_DB3_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define LCD_DB3_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB3_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define LCD_DB3_PIN 17U                   /*!<@brief PORT pin number */
#define LCD_DB3_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTB3 (number 31), LCD_DB4
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB4_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define LCD_DB4_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define LCD_DB4_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB4_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LCD_DB4_PIN 3U                   /*!<@brief PORT pin number */
#define LCD_DB4_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTC0 (number 26), LCD_DB5
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB5_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define LCD_DB5_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LCD_DB5_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB5_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LCD_DB5_PIN 0U                   /*!<@brief PORT pin number */
#define LCD_DB5_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTB1 (number 33), LCD_DB6
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB6_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define LCD_DB6_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define LCD_DB6_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB6_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LCD_DB6_PIN 1U                   /*!<@brief PORT pin number */
#define LCD_DB6_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTC1 (number 25), LCD_DB7
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB7_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define LCD_DB7_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LCD_DB7_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB7_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LCD_DB7_PIN 1U                   /*!<@brief PORT pin number */
#define LCD_DB7_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTB0 (number 34), LCD_RS
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_RS_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define LCD_RS_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define LCD_RS_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_RS_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LCD_RS_PIN 0U                   /*!<@brief PORT pin number */
#define LCD_RS_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTC9 (number 35), LCD_RW
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_RW_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define LCD_RW_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LCD_RW_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_RW_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LCD_RW_PIN 9U                   /*!<@brief PORT pin number */
#define LCD_RW_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTC8 (number 36), LCD_CE
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_CE_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define LCD_CE_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LCD_CE_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_CE_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LCD_CE_PIN 8U                   /*!<@brief PORT pin number */
#define LCD_CE_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTB2 (number 32), LCD_BKL
  @{ */

/* Symbols to be used with PORT driver */
#define LCD_BKL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LCD_BKL_PIN 2U                   /*!<@brief PORT pin number */
#define LCD_BKL_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                         /* @} */

