mizalop/cafe_refactor_orhi/board/pin_mux.h
/*! @name PORTD7 (number 22), KUNAK_TXD
  @{ */

/* Symbols to be used with PORT driver */
#define KUNAK_TXD_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define KUNAK_TXD_PIN 7U                   /*!<@brief PORT pin number */
#define KUNAK_TXD_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD6 (number 23), KUNAK_RXD
  @{ */

/* Symbols to be used with PORT driver */
#define KUNAK_RXD_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define KUNAK_RXD_PIN 6U                   /*!<@brief PORT pin number */
#define KUNAK_RXD_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTE3 (number 13), KUNAK_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define KUNAK_RST_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define KUNAK_RST_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define KUNAK_RST_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define KUNAK_RST_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define KUNAK_RST_PIN 3U                   /*!<@brief PORT pin number */
#define KUNAK_RST_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC6 (number 52), DEBUG_RXD
  @{ */

/* Symbols to be used with PORT driver */
#define DEBUG_RXD_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define DEBUG_RXD_PIN 6U                   /*!<@brief PORT pin number */
#define DEBUG_RXD_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC7 (number 51), DEBUG_TXD
  @{ */

/* Symbols to be used with PORT driver */
#define DEBUG_TXD_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define DEBUG_TXD_PIN 7U                   /*!<@brief PORT pin number */
#define DEBUG_TXD_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD16 (number 14), FAN
  @{ */

/* Symbols to be used with GPIO driver */
#define FAN_FGPIO FGPIOD              /*!<@brief FGPIO peripheral base pointer */
#define FAN_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define FAN_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define FAN_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define FAN_PIN 16U                   /*!<@brief PORT pin number */
#define FAN_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                      /* @} */

/*! @name PORTD2 (number 46), LED_5VDC
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_5VDC_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define LED_5VDC_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define LED_5VDC_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_5VDC_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define LED_5VDC_PIN 2U                   /*!<@brief PORT pin number */
#define LED_5VDC_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTD15 (number 15), PGOOD_DC5V
  @{ */

/* Symbols to be used with GPIO driver */
#define PGOOD_DC5V_FGPIO FGPIOD              /*!<@brief FGPIO peripheral base pointer */
#define PGOOD_DC5V_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define PGOOD_DC5V_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PGOOD_DC5V_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define PGOOD_DC5V_PIN 15U                   /*!<@brief PORT pin number */
#define PGOOD_DC5V_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC3 (number 20), SENSE_DC32V
  @{ */

/* Symbols to be used with PORT driver */
#define SENSE_DC32V_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define SENSE_DC32V_PIN 3U                   /*!<@brief PORT pin number */
#define SENSE_DC32V_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA5 (number 63), RST#
  @{ */

/* Symbols to be used with PORT driver */
#define RST_n_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RST_n_PIN 5U                   /*!<@brief PORT pin number */
#define RST_n_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTA4 (number 64), SWDIO
  @{ */

/* Symbols to be used with PORT driver */
#define SWDIO_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define SWDIO_PIN 4U                   /*!<@brief PORT pin number */
#define SWDIO_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTC4 (number 62), SWCLK
  @{ */

/* Symbols to be used with PORT driver */
#define SWCLK_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define SWCLK_PIN 4U                   /*!<@brief PORT pin number */
#define SWCLK_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name VSS (number 10), VREFL
  @{ */
/* @} */

/*! @name VSS61 (number 40), GND
  @{ */
/* @} */

/*! @name VDD62 (number 41), DC5V
  @{ */
/* @} */

/*! @name VREFH (number 9), VREFH
  @{ */
/* @} */

/*! @name VDDA (number 8), VDDA
  @{ */
/* @} */

/*! @name VDD10 (number 7), DC5V
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ORHY_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
